{
  "nav": {
    "home": "Home",
    "about": "About the Project",
    "testImages": "Test Images",
    "scientificArticle": "Scientific Article",
    "github": "Project Github"
  },
  "home": {
    "title": "Brain Tumor Detection with AI",
    "subtitle": "Intelligent diagnostic support system that identifies and classifies brain tumors in MRI scans.",
    "uploadTitle": "Upload Your Image",
    "uploadDescription": "Upload a brain MRI scan",
    "uploadArea": "Click to select or drag an image",
    "uploadFormats": "PNG, JPG, GIF up to 10MB",
    "chooseAnother": "Choose another image",
    "removeImage": "Remove image",
    "submit": "Submit",
    "sending": "Sending..."
  },
  "result": {
    "analyzing": "Analyzing image...",
    "analyzingDesc": "Please wait while we process your image.",
    "startingServer": "Starting server...",
    "startingServerDesc": "We are preparing our server to process your image. This may take a few moments. Please do not close this window.",
    "serverRestarting": "Server restarting...",
    "serverRestartingDesc": "The server was shut down due to inactivity and is being restarted. This process takes approximately 2 minutes. Please wait.",
    "timeRemaining": "Estimated time remaining:",
    "title": "Analysis Result",
    "description": "Here is the result of your image analysis.",
    "globalAccuracy": "Model's global accuracy:",
    "predictionConfidence": "Confidence in this prediction:",
    "warning": "Important:",
    "warningText": "This result is only a prediction from the AI model and does not replace a professional medical evaluation. Always consult a specialist doctor for accurate diagnoses.",
    "invalidImageTitle": "Invalid Image",
    "invalidImageDesc": "The model only accepts grayscale brain MRI images. The image cannot contain circles, arrows, text, or any colored pixels.",
    "invalidImageButton": "I Understand"
  },
  "help": {
    "button": "How Does It Work?",
    "title": "How to use the system",
    "description": "This system uses convolutional neural networks (an artificial intelligence technology) to automatically analyze brain MRI scans and identify possible tumors.",
    "instructionsTitle": "How to use:",
    "step1": "Click on the upload area or drag a brain MRI image",
    "step2": "Wait while the artificial intelligence processes and analyzes the image",
    "step3": "The system will identify if there is a tumor and, if so, what type it is",
    "step4": "View the result with the classification and confidence percentage of the analysis",
    "tumorTypesTitle": "Types of tumors identified by the system:",
    "meningioma": "Meningioma",
    "meningiomaDesc": "A tumor that grows in the meninges, which are the protective membranes of the brain and spinal cord. Usually grows slowly and, in most cases, is not malignant.",
    "glioma": "Glioma",
    "gliomaDesc": "A tumor that forms from the brain's support cells (glial cells). Can be slow or fast-growing, and is one of the most common types of brain tumors.",
    "pituitary": "Pituitary Tumor",
    "pituitaryDesc": "A tumor that develops in the pituitary gland, a small gland at the base of the brain responsible for hormone production. Most of these tumors are non-cancerous, but can cause hormonal changes.",
    "noTumor": "No Tumor",
    "noTumorDesc": "Healthy brain image with no signs of tumor. This category confirms when there is no tumor present in the scan.",
    "note": "Important:",
    "noteText": "This system is a diagnostic support tool and does not replace evaluation by a medical specialist. Results should always be interpreted by a qualified healthcare professional."
  },
  "footer": {
    "rights": "All rights reserved."
  },
  "about": {
    "title": "About the Project",
    "subtitle": "Scientific Research Project that uses artificial intelligence to assist in the diagnosis of brain tumors.",
    "introTitle": "What is this project?",
    "intro": "This is a medical diagnostic support system that uses artificial intelligence to identify and classify brain tumors in MRI scans. The goal is to help healthcare professionals detect tumors more quickly and accurately.",
    "whatIsCnnTitle": "How Does Artificial Intelligence Analyze Images?",
    "whatIsCnn": "The system uses a technology called Convolutional Neural Network (CNN), which is inspired by how the human brain processes visual information. This network was trained with thousands of MRI images to learn to recognize patterns that indicate the presence of tumors.",
    "howItWorksTitle": "How Does the System Work?",
    "howItWorksDesc": "The analysis process happens in stages:",
    "step1": "Image Preparation: The system adjusts the size and format of the scan image so it can be analyzed.",
    "step2": "Intelligent Analysis: The neural network examines the image looking for characteristics that may indicate the presence of tumors.",
    "step3": "Classification: The system identifies whether there is a tumor and, if so, classifies the type (glioma, meningioma, pituitary tumor, or no tumor).",
    "step4": "Result: The system presents the diagnosis with a confidence percentage, showing how certain it is of its analysis.",
    "modelTitle": "The Artificial Intelligence Model",
    "modelDesc": "We use the MobileNetV2 model, a neural network recognized for its efficiency and accuracy. This model was initially trained with millions of general images and then specifically refined to recognize brain tumors.",
    "datasetTitle": "Dataset Used",
    "datasetDesc": "The system was trained and tested with the Brain Tumor MRI Dataset, publicly available on Kaggle. This database contains over 7,000 MRI images, divided into four categories: glioma, meningioma, pituitary tumor, and no tumor.",
    "datasetLink": "Access Dataset on Kaggle",
    "resultsTitle": "System Performance",
    "resultsDesc": "The system demonstrated high accuracy in the tests performed:",
    "accuracy": "Overall accuracy rate of 90.6% in tumor identification and classification",
    "tumorDetection": "Identification of healthy brains (no tumor): 97.2% accuracy",
    "pituitaryDetection": "Identification of pituitary tumors: 96.0% accuracy",
    "gliomaDetection": "Identification of gliomas: 94.4% accuracy",
    "meningiomaNote": "Note: Distinguishing between gliomas and meningiomas can be challenging, as these tumors may have similar visual characteristics in some scans.",
    "limitationsTitle": "Limitations and Precautions",
    "limitation1": "The system was tested only with images from the database used in training. Images from other equipment or hospitals may present different results.",
    "limitation2": "Differences between MRI machines, settings, and scanning techniques may affect system performance.",
    "limitation3": "The system does not replace professional medical evaluation. It is a support tool that should be used together with the clinical expertise of specialists.",
    "futureTitle": "Next Steps",
    "future1": "Test the system with images from different hospitals and equipment to ensure it works well in various scenarios",
    "future2": "Add visual explanation features that show which parts of the image were important for the system's decision",
    "future3": "Evaluate the real impact of the system in the daily routine of hospitals and clinics",
    "future4": "Incorporate additional clinical information from patients to further improve accuracy",
    "techTitle": "Technologies Used",
    "techFrontendTitle": "System Interface (Frontend):",
    "techBackendTitle": "API and Artificial Intelligence (Backend):",
    "tech1": "Next.js 15 - Platform for creating fast and modern websites",
    "tech2": "React 19 - Library for building interactive interfaces",
    "tech3": "TypeScript - Safer and more organized programming language",
    "tech4": "Tailwind CSS 4 - Visual styling system",
    "tech5": "shadcn/ui - Reusable interface components",
    "tech6": "Axios - HTTP client for API communication",
    "tech7": "Python 3.10 - Programming language for API development",
    "tech8": "FastAPI - Modern and fast web framework for building APIs",
    "tech9": "TensorFlow/Keras - Libraries for creating and training artificial intelligence",
    "tech10": "NumPy, Pandas, Scikit-learn - Tools for data processing and analysis",
    "tech11": "Pillow - Library for image processing",
    "tech12": "Uvicorn - High-performance ASGI server",
    "authorsTitle": "Team",
    "author1": "Leon Pereira Pinto Fagundes - System Development",
    "author2": "Prof. Dr. Waldemar Bonventi Júnior - Research Supervision",
    "institutionTitle": "Institution",
    "institution": "FATEC Votorantim - Multiplatform Software Development"
  },
  "dropdown": {
    "dataBasesTitle": "Brain Tumor databases",
    "kaggle": "Kaggle",
    "kaggleDesc": "Main image database used in the project",
    "figshare": "Figshare",
    "figshareDesc": "Repository with images from scientific studies",
    "scienceDataBank": "Science Data Bank",
    "scienceDataBankDesc": "Database focused on medical research",
    "googleImages": "Google Images",
    "googleImagesDesc": "Search for brain MRI images",
    "githubTitle": "Project Repositories",
    "frontend": "Frontend",
    "frontendDesc": "User interface and web system",
    "backend": "Backend",
    "backendDesc": "API and artificial intelligence model"
  }
}
