{
  "nav": {
    "home": "Inicio",
    "about": "Sobre el Proyecto",
    "testImages": "Imágenes de Prueba",
    "scientificArticle": "Artículo Científico",
    "github": "Github del Proyecto"
  },
  "home": {
    "title": "DetectIA",
    "subtitle": "Sistema inteligente que realiza detección de tumores cerebrales con IA. Asiste en el diagnóstico identificando y clasificando tumores cerebrales en imágenes de resonancia magnética.",
    "uploadTitle": "Suba su Imagen",
    "uploadDescription": "Cargue un examen de resonancia magnética cerebral",
    "uploadArea": "Haga clic para seleccionar o arrastre una imagen",
    "uploadFormats": "PNG, JPG, GIF hasta 10MB",
    "chooseAnother": "Elegir otra imagen",
    "removeImage": "Eliminar imagen",
    "submit": "Enviar",
    "sending": "Enviando..."
  },
  "result": {
    "analyzing": "Analizando imagen...",
    "analyzingDesc": "Espere mientras procesamos su imagen.",
    "startingServer": "Iniciando servidor...",
    "startingServerDesc": "Estamos preparando nuestro servidor para procesar su imagen. Esto puede tomar algunos instantes. Por favor, no cierre esta ventana.",
    "serverRestarting": "Servidor reiniciando...",
    "serverRestartingDesc": "El servidor fue apagado por inactividad y está siendo reiniciado. Este proceso toma aproximadamente 3 minutos. Por favor, espere.",
    "timeRemaining": "Tiempo estimado restante:",
    "title": "Resultado del Análisis",
    "description": "Aquí está el resultado del análisis de su imagen.",
    "globalAccuracy": "Precisión global del modelo:",
    "predictionConfidence": "Confianza en esta predicción:",
    "warning": "Importante:",
    "warningText": "Este resultado es solo una predicción del modelo de IA y no reemplaza una evaluación médica profesional. Siempre consulte a un médico especialista para diagnósticos precisos.",
    "invalidImageTitle": "Imagen Inválida",
    "invalidImageDesc": "El modelo solo acepta imágenes de resonancia magnética cerebral en escala de grises. La imagen no puede contener círculos, flechas, textos o píxeles de color.",
    "invalidImageButton": "Entendido"
  },
  "help": {
    "button": "¿Cómo Funciona?",
    "title": "Cómo utilizar el sistema",
    "description": "Este sistema utiliza redes neuronales convolucionales (una tecnología de inteligencia artificial) para analizar automáticamente exámenes de resonancia magnética del cerebro e identificar posibles tumores.",
    "instructionsTitle": "Cómo usar:",
    "step1": "Haga clic en el área de carga o arrastre una imagen de resonancia magnética cerebral",
    "step2": "Espere mientras la inteligencia artificial procesa y analiza la imagen",
    "step3": "El sistema identificará si existe un tumor y, en caso afirmativo, qué tipo es",
    "step4": "Vea el resultado con la clasificación y el porcentaje de confianza del análisis",
    "tumorTypesTitle": "Tipos de tumores identificados por el sistema:",
    "meningioma": "Meningioma",
    "meningiomaDesc": "Tumor que crece en las meninges, que son las membranas protectoras del cerebro y la médula espinal. Generalmente crece lentamente y, en la mayoría de los casos, no es maligno.",
    "glioma": "Glioma",
    "gliomaDesc": "Tumor que se forma a partir de las células de soporte del cerebro (células gliales). Puede ser de crecimiento lento o rápido, y es uno de los tipos más comunes de tumor cerebral.",
    "pituitary": "Tumor Hipofisario (Pituitario)",
    "pituitaryDesc": "Tumor que se desarrolla en la hipófisis, una pequeña glándula en la base del cerebro responsable de la producción de hormonas. La mayoría de estos tumores no es canceroso, pero puede causar alteraciones hormonales.",
    "noTumor": "Sin Tumor",
    "noTumorDesc": "Imagen de cerebro sano, sin signos de tumor. Esta categoría confirma cuando no hay presencia de tumor en el examen.",
    "note": "Importante:",
    "noteText": "Este sistema es una herramienta de apoyo al diagnóstico y no reemplaza la evaluación de un médico especialista. Los resultados siempre deben ser interpretados por un profesional de la salud calificado."
  },
  "footer": {
    "rights": "Todos los derechos reservados."
  },
  "about": {
    "title": "Sobre el Proyecto",
    "subtitle": "Proyecto de Iniciación Científica que utiliza inteligencia artificial para ayudar en el diagnóstico de tumores cerebrales.",
    "introTitle": "¿Qué es este proyecto?",
    "intro": "Este es un sistema de apoyo al diagnóstico médico que utiliza inteligencia artificial para identificar y clasificar tumores cerebrales en exámenes de resonancia magnética. El objetivo es ayudar a los profesionales de la salud a detectar tumores de forma más rápida y precisa.",
    "whatIsCnnTitle": "¿Cómo Analiza la Inteligencia Artificial las Imágenes?",
    "whatIsCnn": "El sistema utiliza una tecnología llamada Red Neuronal Convolucional (CNN, por sus siglas en inglés), que está inspirada en la forma en que el cerebro humano procesa información visual. Esta red fue entrenada con miles de imágenes de resonancia magnética para aprender a reconocer patrones que indican la presencia de tumores.",
    "howItWorksTitle": "¿Cómo Funciona el Sistema?",
    "howItWorksDesc": "El proceso de análisis ocurre en etapas:",
    "step1": "Preparación de la Imagen: El sistema ajusta el tamaño y formato de la imagen del examen para que pueda ser analizada.",
    "step2": "Análisis Inteligente: La red neuronal examina la imagen en busca de características que pueden indicar la presencia de tumores.",
    "step3": "Clasificación: El sistema identifica si hay tumor y, en caso afirmativo, clasifica el tipo (glioma, meningioma, tumor hipofisario o sin tumor).",
    "step4": "Resultado: El sistema presenta el diagnóstico con un porcentaje de confianza, mostrando cuán seguro está de su análisis.",
    "modelTitle": "El Modelo de Inteligencia Artificial",
    "modelDesc": "Utilizamos el modelo MobileNetV2, una red neuronal reconocida por su eficiencia y precisión. Este modelo fue inicialmente entrenado con millones de imágenes generales y luego refinado específicamente para reconocer tumores cerebrales.",
    "datasetTitle": "Base de Datos Utilizada",
    "datasetDesc": "El sistema fue entrenado y probado con el Brain Tumor MRI Dataset, disponible públicamente en Kaggle. Esta base contiene más de 7.000 imágenes de resonancia magnética, divididas en cuatro categorías: glioma, meningioma, tumor hipofisario y sin tumor.",
    "datasetLink": "Acceder a Base de Datos en Kaggle",
    "resultsTitle": "Rendimiento del Sistema",
    "resultsDesc": "El sistema demostró alta precisión en las pruebas realizadas:",
    "accuracy": "Tasa de acierto general del 90,6% en la identificación y clasificación de tumores",
    "tumorDetection": "Identificación de cerebros sanos (sin tumor): 97,2% de precisión",
    "pituitaryDetection": "Identificación de tumores hipofisarios: 96,0% de precisión",
    "gliomaDetection": "Identificación de gliomas: 94,4% de precisión",
    "meningiomaNote": "Nota: La distinción entre gliomas y meningiomas puede ser desafiante, ya que estos tumores pueden tener características visuales similares en algunos exámenes.",
    "limitationsTitle": "Limitaciones y Cuidados",
    "limitation1": "El sistema fue probado solo con las imágenes de la base de datos utilizada en el entrenamiento. Imágenes de otros equipos u hospitales pueden presentar resultados diferentes.",
    "limitation2": "Las diferencias entre aparatos de resonancia magnética, configuraciones y técnicas de examen pueden afectar el rendimiento del sistema.",
    "limitation3": "El sistema no reemplaza la evaluación médica profesional. Es una herramienta de apoyo que debe usarse junto con la experiencia clínica de especialistas.",
    "futureTitle": "Próximos Pasos",
    "future1": "Probar el sistema con imágenes de diferentes hospitales y equipos para garantizar que funcione bien en diversos escenarios",
    "future2": "Agregar recursos de explicación visual que muestren qué partes de la imagen fueron importantes para la decisión del sistema",
    "future3": "Evaluar el impacto real del sistema en el día a día de hospitales y clínicas",
    "future4": "Incorporar información clínica adicional de los pacientes para mejorar aún más la precisión",
    "techTitle": "Tecnologías Utilizadas",
    "techFrontendTitle": "Interfaz del sistema (Frontend):",
    "techBackendTitle": "API e Inteligencia Artificial (Backend):",
    "tech1": "Next.js 15 - Plataforma para crear sitios rápidos y modernos",
    "tech2": "React 19 - Biblioteca para construir interfaces interactivas",
    "tech3": "TypeScript - Lenguaje de programación más seguro y organizado",
    "tech4": "Tailwind CSS 4 - Sistema de estilización visual",
    "tech5": "shadcn/ui - Componentes de interfaz reutilizables",
    "tech6": "Axios - Cliente HTTP para comunicación con la API",
    "tech7": "Python 3.10 - Lenguaje de programación para desarrollo de la API",
    "tech8": "FastAPI - Framework web moderno y rápido para creación de APIs",
    "tech9": "TensorFlow/Keras - Bibliotecas para crear y entrenar la inteligencia artificial",
    "tech10": "NumPy, Pandas, Scikit-learn - Herramientas para procesamiento y análisis de datos",
    "tech11": "Pillow - Biblioteca para procesamiento de imágenes",
    "tech12": "Uvicorn - Servidor ASGI de alto rendimiento",
    "authorsTitle": "Equipo",
    "author1": "Leon Pereira Pinto Fagundes - Desarrollo del sistema",
    "author2": "Prof. Dr. Waldemar Bonventi Júnior - Supervisión de la investigación",
    "institutionTitle": "Institución",
    "institution": "FATEC Votorantim - Tecnología en Desarrollo de Software Multiplataforma"
  },
  "dropdown": {
    "dataBasesTitle": "Bases de Datos Utilizadas",
    "kaggle": "Kaggle",
    "kaggleDesc": "Base principal de imágenes utilizada en el proyecto",
    "figshare": "Figshare",
    "figshareDesc": "Repositorio con imágenes de estudios científicos",
    "scienceDataBank": "Science Data Bank",
    "scienceDataBankDesc": "Base de datos orientada a investigaciones médicas",
    "googleImages": "Google Imágenes",
    "googleImagesDesc": "Búsqueda de imágenes de resonancia magnética cerebral",
    "githubTitle": "Repositorios del Proyecto",
    "frontend": "Frontend",
    "frontendDesc": "Interfaz de usuario y sistema web",
    "backend": "Backend",
    "backendDesc": "API y modelo de inteligencia artificial"
  }
}
