{
  "nav": {
    "home": "Início",
    "about": "Sobre o Projeto",
    "testImages": "Imagens para Teste",
    "scientificArticle": "Artigo Científico",
    "github": "Github do Projeto"
  },
  "home": {
    "title": "DetectIA",
    "subtitle": "Sistema inteligente que faz detecção de tumores cerebrais com IA. Auxilia o diagnóstico que identifica e classifica tumores cerebrais em exames de ressonância magnética.",
    "uploadTitle": "Envie sua Imagem",
    "uploadDescription": "Faça o upload de um exame de ressonância magnética cerebral",
    "uploadArea": "Clique para selecionar ou arraste uma imagem",
    "uploadFormats": "PNG, JPG, GIF até 10MB",
    "chooseAnother": "Escolher outra imagem",
    "removeImage": "Remover imagem",
    "submit": "Enviar",
    "sending": "Enviando...",
    "uploadByCellphone": "Enviar por celular",
    "qrcodeTitle": "Enviar Imagem pelo Celular",
    "qrcodeDescription": "Escaneie o QR Code abaixo com a câmera do seu celular para acessar a página de upload móvel",
    "qrcodeInstructions": "1. Abra a câmera do seu celular\n2. Aponte para o QR Code\n3. Toque na notificação para abrir o link\n4. Escolha ou tire uma foto\n5. A imagem aparecerá aqui",
    "waitingForImage": "Aguardando imagem do celular..."
  },
  "result": {
    "analyzing": "Analisando imagem...",
    "analyzingDesc": "Aguarde enquanto processamos sua imagem.",
    "startingServer": "Iniciando servidor...",
    "startingServerDesc": "Estamos preparando nosso servidor para processar sua imagem. Isso pode levar alguns instantes. Por favor, não feche esta janela.",
    "serverRestarting": "Servidor reiniciando...",
    "serverRestartingDesc": "O servidor foi desligado por inatividade e está sendo reiniciado. Este processo leva aproximadamente 3 minutos. Por favor, aguarde.",
    "timeRemaining": "Tempo estimado restante:",
    "title": "Resultado da Análise",
    "description": "Aqui está o resultado da análise da sua imagem.",
    "globalAccuracy": "Precisão global do modelo:",
    "predictionConfidence": "Confiança nesta predição:",
    "warning": "Importante:",
    "warningText": "Este resultado é apenas uma predição do modelo de IA e não substitui uma avaliação médica profissional. Sempre consulte um médico especialista para diagnósticos precisos.",
    "invalidImageTitle": "Imagem Inválida",
    "invalidImageDesc": "O modelo só aceita imagens de ressonância magnética cerebral em tons de cinza. A imagem não pode conter círculos, setas, textos ou qualquer pixel colorido.",
    "invalidImageButton": "Entendi"
  },
  "help": {
    "button": "Como Funciona?",
    "title": "Como utilizar o sistema",
    "description": "Este sistema utiliza redes neurais convolucionais (uma tecnologia de inteligência artificial) para analisar automaticamente exames de ressonância magnética do cérebro e identificar possíveis tumores.",
    "instructionsTitle": "Como usar:",
    "step1": "Clique na área de upload ou arraste uma imagem de ressonância magnética cerebral",
    "step2": "Aguarde enquanto a inteligência artificial processa e analisa a imagem",
    "step3": "O sistema vai identificar se existe um tumor e, caso exista, qual é o tipo",
    "step4": "Veja o resultado com a classificação e o percentual de confiança da análise",
    "tumorTypesTitle": "Tipos de tumores identificados pelo sistema:",
    "meningioma": "Meningioma",
    "meningiomaDesc": "Tumor que cresce nas meninges, que são as membranas protetoras do cérebro e da medula espinhal. Geralmente cresce devagar e, na maioria dos casos, não é maligno.",
    "glioma": "Glioma",
    "gliomaDesc": "Tumor que se forma a partir das células de suporte do cérebro (células gliais). Pode ser de crescimento lento ou rápido, e é um dos tipos mais comuns de tumor cerebral.",
    "pituitary": "Tumor Hipofisário (Pituitário)",
    "pituitaryDesc": "Tumor que se desenvolve na hipófise, uma pequena glândula na base do cérebro responsável pela produção de hormônios. A maioria desses tumores não é canceroso, mas pode causar alterações hormonais.",
    "noTumor": "Sem Tumor",
    "noTumorDesc": "Imagem de cérebro saudável, sem sinais de tumor. Esta categoria serve para confirmar quando não há presença de tumor no exame.",
    "note": "Importante:",
    "noteText": "Este sistema é uma ferramenta de apoio ao diagnóstico e não substitui a avaliação de um médico especialista. Os resultados devem sempre ser interpretados por um profissional de saúde qualificado."
  },
  "footer": {
    "rights": "Todos os direitos reservados."
  },
  "about": {
    "title": "Sobre o Projeto",
    "subtitle": "Projeto de Iniciação Científica que utiliza inteligência artificial para auxiliar no diagnóstico de tumores cerebrais.",
    "introTitle": "O que é este projeto?",
    "intro": "Este é um sistema de apoio ao diagnóstico médico que usa inteligência artificial para identificar e classificar tumores cerebrais em exames de ressonância magnética. O objetivo é auxiliar profissionais de saúde a detectar tumores de forma mais rápida e precisa.",
    "whatIsCnnTitle": "Como a Inteligência Artificial Analisa as Imagens?",
    "whatIsCnn": "O sistema utiliza uma tecnologia chamada Rede Neural Convolucional (CNN, na sigla em inglês), que é inspirada na forma como o cérebro humano processa informações visuais. Essa rede foi treinada com milhares de imagens de ressonância magnética para aprender a reconhecer padrões que indicam a presença de tumores.",
    "howItWorksTitle": "Como Funciona o Sistema?",
    "howItWorksDesc": "O processo de análise acontece em etapas:",
    "step1": "Preparação da Imagem: O sistema ajusta o tamanho e o formato da imagem do exame para que possa ser analisada.",
    "step2": "Análise Inteligente: A rede neural examina a imagem em busca de características que podem indicar a presença de tumores.",
    "step3": "Classificação: O sistema identifica se há tumor e, em caso positivo, classifica o tipo (glioma, meningioma, tumor hipofisário ou sem tumor).",
    "step4": "Resultado: O sistema apresenta o diagnóstico com um percentual de confiança, mostrando o quão certo está da sua análise.",
    "modelTitle": "O Modelo de Inteligência Artificial",
    "modelDesc": "Utilizamos o modelo MobileNetV2, uma rede neural reconhecida pela sua eficiência e precisão. Este modelo foi inicialmente treinado com milhões de imagens gerais e depois refinado especificamente para reconhecer tumores cerebrais.",
    "datasetTitle": "Base de Dados Utilizada",
    "datasetDesc": "O sistema foi treinado e testado com o Brain Tumor MRI Dataset, disponível publicamente no Kaggle. Esta base contém mais de 7.000 imagens de ressonância magnética, divididas em quatro categorias: glioma, meningioma, tumor hipofisário e sem tumor.",
    "datasetLink": "Acessar Base de Dados no Kaggle",
    "resultsTitle": "Desempenho do Sistema",
    "resultsDesc": "O sistema demonstrou alta precisão nos testes realizados:",
    "accuracy": "Taxa de acerto geral de 93,16% na identificação e classificação de tumores",
    "tumorDetection": "Identificação de cérebros saudáveis (sem tumor): 95,66% de precisão",
    "pituitaryDetection": "Identificação de tumores hipofisários: 98,76% de precisão",
    "gliomaDetection": "Identificação de gliomas: 97,86% de precisão",
    "meningiomaDetection": "Identificação de meningiomas: 80,36% de precisão",
    "meningiomaNote": "Nota: A distinção entre gliomas e meningiomas pode ser desafiadora, pois esses tumores podem ter características visuais semelhantes em alguns exames.",
    "limitationsTitle": "Limitações e Cuidados",
    "limitation1": "O sistema foi testado apenas com as imagens da base de dados utilizada no treinamento. Imagens de outros equipamentos ou hospitais podem apresentar resultados diferentes.",
    "limitation2": "Diferenças entre aparelhos de ressonância magnética, configurações e técnicas de exame podem afetar o desempenho do sistema.",
    "limitation3": "O sistema não substitui a avaliação médica profissional. É uma ferramenta de apoio que deve ser usada junto com a experiência clínica de especialistas.",
    "futureTitle": "Próximos Passos",
    "future1": "Testar o sistema com imagens de diferentes hospitais e equipamentos para garantir que funcione bem em diversos cenários",
    "future2": "Adicionar recursos de explicação visual que mostrem quais partes da imagem foram importantes para a decisão do sistema",
    "future3": "Avaliar o impacto real do sistema no dia a dia de hospitais e clínicas",
    "future4": "Incorporar informações clínicas adicionais dos pacientes para melhorar ainda mais a precisão",
    "techTitle": "Tecnologias Utilizadas",
    "techFrontendTitle": "Interface do sistema (Frontend):",
    "techBackendTitle": "API e Inteligência Artificial (Backend):",
    "tech1": "Next.js 15 - Plataforma para criar sites rápidos e modernos",
    "tech2": "React 19 - Biblioteca para construir interfaces interativas",
    "tech3": "TypeScript - Linguagem de programação mais segura e organizada",
    "tech4": "Tailwind CSS 4 - Sistema de estilização visual",
    "tech5": "shadcn/ui - Componentes de interface reutilizáveis",
    "tech6": "Axios - Cliente HTTP para comunicação com a API",
    "tech7": "Python 3.10 - Linguagem de programação para desenvolvimento da API",
    "tech8": "FastAPI - Framework web moderno e rápido para criação de APIs",
    "tech9": "TensorFlow/Keras - Bibliotecas para criar e treinar a inteligência artificial",
    "tech10": "NumPy, Pandas, Scikit-learn - Ferramentas para processamento e análise de dados",
    "tech11": "Pillow - Biblioteca para processamento de imagens",
    "tech12": "Uvicorn - Servidor ASGI de alta performance",
    "authorsTitle": "Equipe",
    "author1": "Leon Pereira Pinto Fagundes - Desenvolvimento do sistema",
    "author2": "Prof. Dr. Waldemar Bonventi Júnior - Orientação da pesquisa",
    "institutionTitle": "Instituição",
    "institution": "FATEC Votorantim - Tecnologia em Desenvolvimento de Software Multiplataforma"
  },
  "dropdown": {
    "dataBasesTitle": "Bases de Dados Utilizadas",
    "kaggle": "Kaggle",
    "kaggleDesc": "Base principal de imagens utilizada no projeto",
    "figshare": "Figshare",
    "figshareDesc": "Repositório com imagens de estudos científicos",
    "scienceDataBank": "Science Data Bank",
    "scienceDataBankDesc": "Base de dados voltada para pesquisas médicas",
    "googleImages": "Google Imagens",
    "googleImagesDesc": "Pesquisa de imagens de ressonância magnética cerebral",
    "githubTitle": "Repositórios do Projeto",
    "frontend": "Frontend",
    "frontendDesc": "Interface do usuário e sistema web",
    "backend": "Backend",
    "backendDesc": "API e modelo de inteligência artificial"
  }
}
